In [1]:
import os, sys

In [6]:
os.listdir('ch13/')

['13-3-1-使用sqlite3管理SQLite資料庫.py',
 '13-5-1-模組SQLAlchemy與PyMysql管理Mysql資料庫.py',
 'ex1-查詢學生成績.py',
 'ex2-修改學生成績.py',
 'school.db']

In [ ]:
# %load ch13/13-3-1-使用sqlite3管理SQLite資料庫.py
import sqlite3
con=sqlite3.connect('school.db')
cur=con.cursor()
cur.execute('DROP TABLE stu')
cur.execute('''CREATE TABLE stu
(   stuid   INTEGER       PRIMARY KEY,
    name   VARCHAR(50)   not null,
    pid     VARCHAR(20)   not null,
    phone   VARCHAR(20)   not null)''' )
cur.execute("INSERT INTO stu VALUES (104001,'Claire','B342222','1245667')")
cur.execute('SELECT * FROM stu')
rows=cur.fetchall()
print(rows)
cur.close()

In [ ]:
# %load ch13/13-5-1-模組SQLAlchemy與PyMysql管理Mysql資料庫.py
import sqlalchemy as sa
dbc = 'mysql+pymysql://root:cococola@localhost:3306'
con = sa.create_engine(dbc)
con.execute('CREATE DATABASE school')
con.execute('USE  school')
sql = """CREATE  TABLE  stu (
    stuid   INTEGER       PRIMARY KEY,
    name   VARCHAR(50)  not null,
    pid     VARCHAR(20)  not null,
    phone   VARCHAR(20)  not null )"""
con.execute(sql)
sql="INSERT INTO stu VALUES (104001,'Claire','B342222','1245667')"
con.execute(sql)
result=con.execute("SELECT * FROM stu")
rows = result.fetchall()
print(rows)
con.execute('DROP  TABLE  stu')
con.execute('DROP  DATABASE  school')

In [ ]:
# %load ch13/ex1-查詢學生成績.py
import sqlalchemy as sa
dbc = 'mysql+pymysql://root:cococola@localhost:3306'
con = sa.create_engine(dbc)
con.execute('CREATE DATABASE school')
con.execute('USE  school')
sql = """CREATE  TABLE  stu (
    stuid   INTEGER       PRIMARY KEY,
    name   VARCHAR(50)  not null,
    pid     VARCHAR(20)  not null,
    phone   VARCHAR(20)  not null )"""
con.execute(sql)
sql="INSERT INTO stu VALUES (104001,'Claire','B342222','245667')"
con.execute(sql)
sql="INSERT INTO stu VALUES (104002,'John','J224122','222455')"
con.execute(sql)
sql = """CREATE  TABLE  score (
    stuid   INTEGER       not null,
    sem   VARCHAR(50)  not null,
    sub    VARCHAR(20)  not null,
    score   INTEGER  not null )"""
con.execute(sql)
sql="INSERT INTO score VALUES (104001,'1041','CH',95)"
con.execute(sql)
sql="INSERT INTO score VALUES (104001,'1041','EN',83)"
con.execute(sql)
sql="INSERT INTO score VALUES (104002,'1041','CH',65)"
con.execute(sql)
sql="INSERT INTO score VALUES (104002,'1041','EN',96)"
con.execute(sql)
sql="SELECT stu.name,score.sem,score.sub,score.score FROM stu,score WHERE stu.stuid=score.stuid"
result=con.execute(sql)
rows = result.fetchall()
print(rows)
con.execute('DROP  TABLE  stu')
con.execute('DROP  TABLE  score')
con.execute('DROP  DATABASE  school')

In [ ]:
# %load ch13/ex2-修改學生成績.py
import sqlalchemy as sa
dbc = 'mysql+pymysql://root:cococola@localhost:3306'
con = sa.create_engine(dbc)
con.execute('CREATE DATABASE school')
con.execute('USE  school')
sql = """CREATE  TABLE  stu (
    stuid   INTEGER       PRIMARY KEY,
    name   VARCHAR(50)  not null,
    pid     VARCHAR(20)  not null,
    phone   VARCHAR(20)  not null )"""
con.execute(sql)
sql="INSERT INTO stu VALUES (104001,'Claire','B342222','245667')"
con.execute(sql)
sql="INSERT INTO stu VALUES (104002,'John','J224122','222455')"
con.execute(sql)
sql = """CREATE  TABLE  score (
    stuid   INTEGER       not null,
    sem   VARCHAR(50)  not null,
    sub    VARCHAR(20)  not null,
    score   INT  not null )"""
con.execute(sql)
sql="INSERT INTO score VALUES (104001,'1041','CH',95)"
con.execute(sql)
sql="INSERT INTO score VALUES (104001,'1041','EN',83)"
con.execute(sql)
sql="INSERT INTO score VALUES (104002,'1041','CH',65)"
con.execute(sql)
sql="INSERT INTO score VALUES (104002,'1041','EN',96)"
con.execute(sql)
sql="SELECT stu.name,score.sem,score.sub,score.score FROM stu,score WHERE stu.stuid=score.stuid"
result=con.execute(sql)
rows = result.fetchall()
print(rows)
sql="UPDATE score SET score=89 WHERE stuid=104001 and sem='1041' and sub='EN'"
con.execute(sql)
sql="SELECT stu.name,score.sem,score.sub,score.score FROM stu,score WHERE stu.stuid=score.stuid"
result=con.execute(sql)
rows = result.fetchall()
print(rows)
con.execute('DROP  TABLE  stu')
con.execute('DROP  TABLE  score')
con.execute('DROP  DATABASE  school')